Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཁ་ཅིག་ནི་མིའི་སོར་མོ་བཅད་ནས་ཕྲེང་བར་བརྒྱུས་ཏེ་ཐོགས་སོ།
en: Some of them wore garlands of human fingers that they had cut off and strung together.

source: །ཁ་ཅིག་ནི་ཀེང་རུས་དང་། ཐོད་པ་དག་ཕྲེང་བ་ལྟ་བུར་བརྒྱུས་ཏེ་ཐོགས་སོ། །ཁ་ཅིག་ནི་ལུས་སྦྲུལ་གདུག་པས་དཀྲིས་སོ།
en: Others wore on their heads bones, hands, and skulls, which they had strung into garlands, and some had their bodies covered in poisonous snakes.

source: །ཁ་ཅིག་ནི་མགོ་ལ་ཞུགས་ལིང་མེ་ཅན་ཐོགས་ཏེ། གླང་པོ་དང་། རྟ་དང་། རྔ་མོ་དང་། བ་ལང་དང་། བོང་བུ་དང་། མ་ཧེ་ལ་ཞོན་ནོ།
en: Some were holding skulls and rode on elephants, horses, camels, donkeys, and buffaloes. Some had their heads pointing down and feet up.

source: །ཁ་ཅིག་ནི་སྤྱིའུ་ཚུགས་སུ་འདུག་ལ་ཁབ་ལྟ་བུའི་སྤུ་ཅན་དག་གོ།
en: Some had needle-like hair on their heads.

source: །ཁ་ཅིག་ནི་བ་ལང་དང་། བོང་བུ་དང་། ཕག་རྒོད་དང་། ནེའུ་ལེ་དང་། ར་དང་། ལུག་དང་། བྱི་ལ་དང་། སྤྲེའུ་དང་། སྤྱང་ཀི་དང་། ཅེ་སྤྱང་གི་སྤུ་ལྟ་བུ་དང་ལྡན་ལ།
en: Others had hair like oxen, donkeys, boars, mongooses, goats, sheep, cats, monkeys, wolves, or jackals.

source: སྦྲུལ་གདུག་པ་སྐྱུག་ཅིང་ལྕགས་ཀྱི་ཐུ་ལུམ་མིད་པ་དང་། མེ་འབྱིན་པ་དང་། ལྕགས་དང་། ཟངས་འབར་བའི་ཆར་འབེབས་པ་དང་། ལྕེ་འབེབས་པ་དང་། རྡོ་རྗེའི་ལྕེ་འབེབས་པ་དང་། ལྕགས་ཀྱི་བྱེ་མཚན་མོའི་ཆར་འབེབས་པ་དང་། སྤྲིན་ནག་པོ་བསྡུས་ཏེ་རླུང་གི་ཆར་འབེབས་པ་དང་། མདའི་སྤྲིན་བསྡུས་ཏེ་ཆར་དུ་འབེབས་པ་དང་། མུན་གནག་སྟོན་པ་དང་། སྒྲ་འབྱིན་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་ལོགས་སུ་རྒྱུག་པ་དག་གོ།
en: They were vomiting poisonous snakes, spitting out lumps of iron, spewing fire, and producing a rain of flaming iron and copper. They sent rains with thunder, released bolts of lightning, caused a rain of hot iron sands, gathered black clouds, and made storms arise. They sent rains consisting of masses of arrows, bringing darkness and causing swishing sounds as they ran toward the Bodhisattva.

source: །ཁ་ཅིག་ནི་ཞགས་པ་སྐོར་བ་དང་། རི་ཆེན་པོ་རྙིལ་བར་བྱེད་པ་དང་། རྒྱ་མཚོ་ཆེན་པོ་འཁྲུགས་པར་བྱེད་པ་དང་། རི་ཆེན་པོ་ལས་མཆོང་བ་དང་། རིའི་རྒྱལ་པོ་ལྷུན་པོ་སྒུལ་བ་དང་། རྒྱུག་པ་དང་། འབྲོས་པ་དང་། ཡན་ལག་དང་། ཉིང་ལག་འཐོར་བ་དང་། ལུས་སྐོར་བ་དང་གད་མོ་ཆེར་རྒོད་པ་དང་། བྲང་རྡུང་བ་དང་། བྲང་ལ་རྡེབ་པ་དང་། མགོ་གསིག་པ་དང་། མགོ་འབར་ཞིང་སྐྲ་གྱེན་དུ་འགྲེང་བ་དང་། ཕན་ཚུན་ཤུགས་ཕྱུང་སྟེ་རྒྱུག་ཅིང་ཝའི་མིག་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འཇིགས་པར་བྱེད་དོ།
en: Some of the soldiers swung their lassos, destroyed great mountains, stirred the vast oceans, jumped over tall mountains, and shook Meru, the king of mountains. In this way they came running, throwing their limbs in the air and rocking their bodies. They cried out loudly in laughter, slapped and beat their chests, and disheveled their hair. Their faces were yellow, their bodies blue, their heads flaming with the hair streaming upward. Running around impetuously, darting here and there with eyes like a fox, they tried to frighten the Bodhisattva.

source: །བུད་མེད་རྒན་མོ་དག་ཀྱང་ངུ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་ལྷགས་ཏེ། འདི་སྐད་དུ་ཀྱི་ཧུད་བུ།
en: Old women approached the Bodhisattva and called out to him, “Oh no, son!

source: ཀྱི་ཧུད་ངའི་བུ། ལོངས་ཤིག །ལོངས་ལ་མྱུར་དུ་བྲོས་ཤིག་ཅེས་འཛེར་ཏོ། །སྲིན་མོའི་གཟུགས་དང་། ཤ་ཟ་མོའི་གཟུགས་དང་། ཡི་དགས་ལོང་བ། ཐེང་པོ། རྐེ་བ། བཀྲེས་པས་རིད་པ། ལག་པ་བསྒྲེང་བ། ཁ་གཅུས་པ་དག་ཀྱང་ངུ་ཞིང་འཇིགས་པ་སྟོན་ཏེ། སྔངས་པར་བྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་མདུན་ན་རྒྱུག་གོ། །བདུད་ཀྱི་དཔུང་འདུས་པ་རྣམ་པ་དེ་ལྟ་བུ་དེས་དཔག་ཚད་བརྒྱད་ཅུ་ཁོར་ཁོར་ཡུག་ཏུ་གང་བར་གྱུར་ཏོ།
en: Oh no, my son! Get up! Quick, get up and flee!” Awful forms of demonesses, flesh eaters, and hungry spirits—one-eyed, limping, and with hunger in their eyes—ran toward the Bodhisattva with outstretched hands, distorted faces, and terrifying cries. They were fearful and horrifying.

source: །བདུད་གཅིག་གི་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱར་གཏོགས་པའི་བདུད་སྡིག་ཅན་རྣམས་ཀྱི་དཔུང་དག་གིས་ཐད་ཀ་དང་། སྟེང་གང་བར་གྱུར་ཏོ།
en: Such an army of demons formed a big gathering, stretching eighty leagues on every side. Just like this single army, so too the armies of hundreds of zillions of evil demons, residing in the great trichiliocosm, spread themselves around the Bodhisattva in horizontal and upward directions.

source: གནོད་སྦྱིན་གྲུལ་བུམ་ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས།
en: Forms of yakṣas, kumbhāṇḍas, and mahoragas,

source: །སྲིན་པོ་ཡི་དགས་ཤ་ཟའི་གཟུགས་དང་བཅས།
en: As well as rākṣasas, hungry spirits, and flesh eaters,

source: །འཇིག་རྟེན་མི་སྡུག་དྲག་གཟུགས་ཇི་སྙེད་པ།
en: In any form that the world finds ugly and fierce,

source: །ཐམས་ཅད་སྒྱུ་ཡིས་དེར་ནི་སྤྲུལ་པ་བྱས།
en: All have been magically manifested there by these rogues.

source: །མགོ་གཅིག་མགོ་གཉིས་མགོ་གསུམ་ལྡན་པ་ནས།
en: They have one, two, three heads,

source: །མགོ་སྟོང་བར་དུ་ལྡན་བཞིན་གནོད་སྦྱིན་མང་།
en: Up to a thousand faces.

source: །ལག་གཅིག་ལག་གཉིས་ལག་གསུམ་ལྡན་པ་ནས།
en: One, two, three arms,

source: །ལག་སྟོང་བར་དུ་ལྡན་པ་རབ་ཏུ་མང་། །རྐང་གཅིག་རྐང་གཉིས་རྐང་གསུམ་ལྡན་པ་ནས།
en: Up to a thousand arms. There are also many with one, two, three legs,

source: །རྐང་སྟོང་བར་དུ་ལྡན་པ་གཞན་ཡང་མང་།
en: Even some with a thousand legs.

source: །ཁ་བཞིན་སྔོ་ལ་ལུས་ནི་སེར་བ་དང་། །ཁ་བཞིན་སེར་ལ་ལུས་ནི་སྔོ་བ་དང་། །ཁ་བཞིན་དཀར་ལ་ལུས་ནི་གནག་པ་དང་། །ཁ་བཞིན་གནག་ལ་ལུས་ནི་དཀར་བ་དང་། །ཁ་བཞིན་གཞན་ལ་ལུས་ཀྱང་གཞན་པ་དང་། །དེ་འདྲའི་ཕྱག་བརྙན་དག་གི་དཔུང་རྣམས་ལྷགས། །སྟག་དང་སྦྲུལ་དང་ཕག་གི་གདོང་ཅན་དང་། །གླང་པོ་རྟ་དང་བོང་བུ་རྔ་མོའི་གདོང་།
en: Some have a blue face and a yellow body; Others have a yellow face and a blue body. Their heads and bodies do not match; Such is the army of soldiers approaching. They have faces like tigers, snakes, and hogs, Elephants, horses, donkeys, and camels,

source: །སྤྲེའུ་དང་སེང་གེ་དྲེད་ཀྱི་གདོང་ཅན་དང་། །དེ་འདྲའི་ཁ་གདོང་ལྡན་པའི་དཔུང་རྣམས་ལྷགས།
en: Monkeys, lions, or bears. Such are the faces of the approaching army.

source: །རལ་པ་བརྫེས་ལ་འཇིགས་པའི་གནོད་སྦྱིན་མང་།
en: Many terrifying malevolent spirits approach,

source: །ལུག་མགོ་རུས་པ་འབར་འབུར་ལྦ་བ་ཅན།
en: With wild matted hair, sheep heads, crooked bones, and goiters;

source: །ལུས་ནི་མི་ཡི་ཁྲག་གིས་རབ་ཏུ་སྦགས།
en: Their bodies are drenched with human blood.

source: །གནོད་སྦྱིན་དེ་འདྲ་བ་དག་དེར་ཡང་ལྷགས།
en: Such are the malevolent spirits that approach.

source: །རྐང་པ་དག་ནི་དགོ་བའི་རྐང་པ་འདྲ།
en: Their legs are like the legs of an antelope;

source: །མིག་གི་འབྲས་བུ་སྤྲེའུའི་མིག་དང་མཚུངས།
en: Their eyeballs look like those of monkeys;

source: །མཆེ་བ་དག་ནི་གླང་པོའི་མཆེ་བ་འདྲ།
en: Their fangs look like elephant tusks.

source: །ཁ་གདོང་དེ་འདྲའི་དཔུང་རྣམས་དེར་ཡང་ལྷགས།
en: Such are the faces of the approaching army.

source: །ལུས་ཀྱི་དབྱིབས་ནི་ཆུ་སྲིན་འདྲ་བ་སྟེ།
en: The shape of their bodies is that of a crocodile;

source: །མིག་གི་འབྲས་བུ་གཉིས་ནི་རབ་ཏུ་འབར།
en: Their two eyeballs are ablaze;

source: །རྣ་བ་དག་ནི་ར་ཡི་རྣ་བ་འདྲ།
en: Their ears are like those of a goat.

source: །ཁ་ཅིག་དག་ནི་ལག་ན་དབྱིག་པ་ཐོགས། །ཐོ་བ་མདུང་ཐུང་རྩེ་གསུམ་ལག་ན་ཐོགས།
en: Some hold up a staff in their hands, Others brandish hammers, clubs, and tridents,

source: །ཁ་ཅིག་རི་བོ་ལྷུན་པོ་ལག་ན་ཐོགས།
en: While some hold Mount Meru in their hands.

source: །འཇིགས་སུ་རུང་བའི་གཟུགས་ཅན་གནོད་སྦྱིན་ལྷགས།
en: These are the terrifying forms of the approaching malevolent spirits.

source: །གཤོལ་ཐོགས་འཁོར་ལོ་ཐོགས་ཤིང་མིག་སྒྱུར་དང་། །རི་རྩེ་ཆེན་པོ་ལག་ན་ཐོགས་པ་དང་། །རླུང་དང་རྡོ་དང་གནམ་ལྕགས་རབ་འབེབས་ཤིང་།
en: They hold up sickles, brandish discuses, roll their eyes, Lift great mountaintops in their hands, And bring down storms and rains of rock and meteor.

source: །གནོད་སྦྱིན་འཇིགས་སུ་རུང་བ་དེར་ཡང་ལྷགས།
en: These are the terrifying malevolent spirits approaching.

source: །རླུང་ནི་རབ་ཏུ་གཏོང་ཞིང་ཆར་ཡང་འབེབས།
en: They blow hurricanes, bring down rainstorms,

source: །བརྒྱ་ཕྲག་སྟོང་གི་གློག་ཀྱང་རབ་ཏུ་འབྱིན།
en: Shoot off billions of lightning bolts,

source: །འབྲུག་གི་སྒྲ་ཡང་སྒྲོག་ཅིང་ཤིང་ལྗོན་སྒྱེལ།
en: Roar with thunder, and sway trees.

source: །བྱང་ཆུབ་ཤིང་གི་ལོ་མ་ཙམ་མི་གཡོ།
en: Yet the leaves on the Bodhi tree remain still.

source: །ཆར་པ་རབ་ཏུ་འབེབས་ཤིང་རླུང་ཡང་གཏོང་།
en: The rain pours down in torrents;

source: །ཆུ་བོ་འབེབས་ཤིང་ཆུ་ཡིས་ས་ཡང་གང་།
en: Rivers overflow and flood the land.

source: །དེ་ལྟར་འཇིགས་སུ་རུང་བ་མཚན་མོ་བྱུང་།
en: So many terrifying things have appeared

source: །དེ་ཡི་ནུབ་མོ་སེམས་མེད་ཤིང་ཡང་སྒྱེལ།
en: That even inanimate trees fall over.

source: །ཐམས་ཅད་དབྱིབས་མི་སྡུག་ཅིང་གཟུགས་མི་སྡུག །འཇིགས་པའི་གཟུགས་ལྡན་དེ་དག་མཐོང་ནས་ཀྱང་།
en: As they witness these terrible forms, All of them ugly and misshapen.

source: །ཡོན་ཏན་མཚན་དང་གཟི་བརྗིད་ལྡན་པ་པོ།
en: Yet the One Who Has Qualities, Marks, and Splendor

source: །ལྷུན་པོ་ལྟ་བུར་སེམས་ནི་གཡོ་བ་མེད།
en: Keeps his mind unshaken, like Mount Meru.

source: །སྒྱུ་མ་འདྲ་ཞིང་རྨི་ལམ་མཚུངས་པ་དང་། །སྤྲིན་དང་འདྲ་བར་ཆོས་རྣམས་ཀུན་ལ་རྟོག །དེ་ལྟར་ཆོས་ཀྱི་ཚུལ་ལ་རྟོག་པས་ན།
en: He sees all phenomena as illusion, Like a dream, and like clouds. Since he sees them in this manner that accords with the Dharma,

source: །ལེགས་གནས་བསམ་གཏན་བྱེད་ཅིང་ཆོས་ལ་གནས།
en: He meditates steadfastly, established in the Dharma.

source: །གང་ཞིག་ང་དང་ང་ཡི་སྙམ་སེམས་ཤིང་།
en: Whoever thinks of “me” and “mine”

source: །དངོས་དང་ལུས་ལ་ཡང་དག་མངོན་ཞེན་པ། །མི་མཁས་འཛིན་པར་གནས་དེས་མཐོང་ནས་ནི།
en: And clings to objects and the body,

source: །འཇིགས་པར་གྱུར་ཅིང་བདག་ཀྱང་རབ་ཏུ་མྱོས།
en: Should be afraid and terrified, Since they are in the clutches of ignorance.

source: །ཤཱཀྱའི་སྲས་པོས་ཆོས་རྣམས་རྟེན་བྱུང་བ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་རྟོགས།
en: The Son of the Śākyas has realized the essential truth That all phenomena arise in dependence and lack reality.

source: །ནམ་མཁའ་ལྟ་བུའི་སེམས་དང་རབ་ཏུ་ལྡན།
en: With a mind like the sky, he is just fine,

source: །དཔུང་བཅས་གཡོ་སྒྱུ་མཐོང་ཡང་མྱོས་པ་མེད།
en: Unperturbed by the spectacle of the army of rogues.

source: །དགེ་སློང་དག་དེ་ལྟར་བདུད་སྡིག་ཅན་གྱི་བུ་སྟོང་པོ་དེ་དག་གི་ནང་ནས་དེད་དཔོན་ལ་སོགས་པ་བདུད་ཀྱི་བུ་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་མངོན་པར་དད་པ་དེ་དག་ནི་བདུད་ཀྱི་གཡས་རོལ་ཏུ་འཁོད་པར་གྱུར་ཏོ།
en: Monks, among the one thousand sons of Māra, the evil one, there were some, such as Sārthavāha, who began to feel devotion toward me, the Bodhisattva.

source: །གང་དག་བདུད་ཀྱི་ཕྱོགས་བྱེད་པ་དེ་དག་ནི་བདུད་སྡིག་ཅན་གྱི་གཡོན་རོལ་ཏུ་འཁོད་པར་གྱུར་ཏོ།
en: They all assembled on the right side of Māra, the evil one, while those who supported Māra took a stand on his left side.

source: །དེ་ན་བདུད་སྡིག་ཅན་གྱིས་རང་གི་བུ་དེ་དག་ལ་སྨྲས་པ། ཡུ་བུ་ཅག་ཅི་འདྲ་བའི་དཔུང་གིས་བྱང་ཆུབ་སེམས་དཔའ་གདུལ་བར་བྱ།
en: Now Māra asked his sons, “What type of army should we use to subdue the Bodhisattva?”

source: དེ་ན་གཡས་རོལ་ནས་བདུད་ཀྱི་བུ་དེད་དཔོན་ཞེས་བྱ་བས་ཕ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Standing to his right, Māra’s son Sārthavāha spoke this verse to his father:

source: ཀླུ་ཡི་དབང་པོ་གཉིད་ལོག་སློང་འདོད་དང་། །གླང་པོའི་དབང་པོ་གཉིད་ལོག་སློང་འདོད་དང་། །རི་དགས་རྒྱལ་པོ་གཉིད་ལོག་སློང་འདོད་པ།
en: “Would you want to wake up the leader of the nāgas? Would you want to wake up the leader of the elephants? Would you want to wake up the king of the animals?

source: །དེ་ནི་མི་དབང་ལེགས་གནས་སློང་བར་འདོད།
en: That is like wanting to disturb the leader of men from his ease.”

source: །གཡོན་རོལ་ནས་བདུད་ཀྱི་བུ་བློ་གྲོས་ངན་པ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Standing to his left, Māra’s son Durmati replied:

source: །བལྟས་པ་ཙམ་གྱིས་སྙིང་ཡང་རབ་ཏུ་འགས་འགྱུར་ལ།
en: “Even at the mere sight of us, people’s hearts burst,

source: །འཇིག་རྟེན་དག་ན་སྙིང་པོ་ལྡན་པའི་ཤིང་ཆེན་འགས།
en: And so does the solid core of great trees.

source: །བདག་གི་ལྟ་བས་ཕོག་ན་འགྲོ་བ་འཆིས་ཕོག་ལྟར།
en: Struck by my stare, what power would this monk have?

source: །འཚོ་བར་འགྱུར་བའི་མཐུ་ནི་དེ་ལ་ག་ལ་མཆིས།
en: Or struck by death, what power would he have to live in this world?”

source: །གཡས་རོལ་ནས་དབྱངས་སྙན་ཅེས་བྱ་བས་སྨྲས་པ།
en: From the right side, Madhura­nirghoṣa spoke:

source: བལྟས་པ་ཙམ་གྱིས་ཤིང་ཡང་འགས་ན་མི་རྣམས་ལ། །བདག་བསྒྲིམ་ཅི་དགོས་ཞེས་སྨྲས་སྙིང་པོ་ག་ལ་ཡོད།
en: “What solid core do trees have for that matter? You say ‘I will break him by staring,’ but can you do that, people?

source: །གལ་ཏེ་བལྟས་པས་རི་བོ་ལྷུན་པོ་འཇིག་འགྱུར་ཡང་།
en: Even if you could destroy Mount Meru with your stare,

source: །དེ་ཡི་མདུན་དུ་ཁྱོད་ནི་མིག་འབྱེད་ཡོང་མི་ནུས།
en: You could not even open your eyes in his presence.

source: །གཞན་ཡང་མི་གང་རྒྱ་མཚོ་ལག་པ་གཉིས་ཀྱིས་རྒལ་འདོད་ཅིང་།
en: “Moreover: To cross the ocean using one’s hands

source: །དེ་ཡི་ཆུ་ནི་བརྔུབས་ཏེ་འཐུང་བར་ནུས་འགྱུར་གྱི།
en: And to drink its water is impossible for people.

source: །དེ་ཡི་ཁ་བཞིན་དྲི་མ་མེད་ལ་མངོན་སུམ་དུ།
en: Yet looking directly at the Bodhisattva’s stainless face

source: །ལྟ་བ་དེ་ནི་དེ་བས་སྡུག་བསྔལ་ཆེ་ཞེས་སྨྲས།
en: Would be even harder than that.”

source: །གཡོན་རོལ་ནས་ལག་བརྒྱ་བ་ཞེས་བྱ་བས་སྨྲས་པ།
en: From the left side, Śatabāhu said:

source: བདག་གི་ལུས་འདི་ལག་པ་བརྒྱ་མཆིས་པ།
en: “My body has one hundred arms,

source: །གཅིག་གིས་ཀྱང་ནི་མདའ་བརྒྱ་འཕང་བགྱིས་ཏེ།
en: And with just one of them I can shoot off one hundred arrows.

source: །དགེ་སྦྱོང་དེ་ཡི་ལུས་ནི་དབུག་པར་བགྱི།
en: O father, I will break the body of this monk!

source: །ཡབ་ཅིག་བདེར་འགྱུར་མ་ཤོལ་ཁྱོད་གཤེགས་ཤིག །གཡས་རོལ་ནས་བློ་བཟང་པོ་ཞེས་བྱ་བས་སྨྲས་པ། བ་སྤུ་རྣམས་ཀྱང་ཅི་ཕྱིར་ལག་པ་མིན། །ལག་པ་བརྒྱ་དང་ཁྱད་པར་ཅི་ཞིག་ཡོད།
en: Be happy and go now without delay.” From the right side, Subuddhi said: “If it is advantageous to have one hundred arms, Why do bodily hairs not become arms?

source: །ལག་པ་རེ་རེར་དེ་ལྟར་མདུང་ཡོད་ཀྱང་།
en: You may hold a spear in each of your hands

source: །དེ་དག་གིས་ཀྱང་དེ་ལ་ཅི་མི་ནུས། །ཅིའི་ཕྱིར་ཞེ་ན།
en: And use them all, yet that will bring you nothing. “Why is that?

source: དེས་ནི་འཇིག་རྟེན་འདས་པའི་བྱམས་པ་བསྒོམས། །བྱམས་ལྡན་ཐུབ་པ་དེ་ཡི་སྐུ་ལ་ནི། །དུག་དང་མཚོན་དང་མེ་ཡིས་མི་ཚུགས་ཏེ། །མཚོན་ཆ་འཕངས་པ་ཐམས་ཅད་མེ་ཏོག་འགྱུར།
en: Because of his love, the body of this sage Is inaccessible to poison, weapons, and fire. Since the love that he feels transcends the world, When you shoot your weapons, they turn into flowers.

source: །གཞན་ཡང་མཁའ་དང་ས་དང་ཆུ་ལ་སྟོབས་ལྡན་གང་།
en: “And moreover: All the powerful ones in the sky, the earth, and the waters,

source: །མིའམ་གནོད་སྦྱིན་རལ་གྲི་དགྲ་སྟ་ཐོགས།
en: Whether humans or guhyakas, may hold up their swords and axes.

source: །མི་དབང་བཟོད་པའི་སྟོབས་ལྡན་དེ་དྲུང་ཕྱིན།
en: But when they go to the leader of men, who has the power of forbearance,

source: །སྟོབས་ཆེན་སྟོབས་ལྡན་དེ་ཀུན་སྟོབས་ཆུང་འགྱུར།
en: They all change from very strong, to strong, to weak.”

source: །གཡོན་རོལ་ནས་གཟི་བརྗིད་དྲག་ཤུལ་ཅན་ཞེས་བྱ་བས་སྨྲས་པ།
en: On the left side, someone named Ugratejas called out:

source: བདག་ནི་དེ་ཡི་ལུས་བཟང་གི།
en: “Invisible, I will enter his beautiful body

source: །ཁོང་དུ་ཞུགས་ཏེ་བསྲེག་པར་བགྱི།
en: And then I will burn it,

source: །འབྲོག་གི་མེ་ལྟར་ཆུང་ངུ་ཡིས།
en: Just like a low forest fire

source: །རྐང་དང་བཅས་པའི་ཤིང་ཡང་བསྐམ།
en: Would burn a dry, hollow tree.”

source: །གཡས་རོལ་ནས་མི་བཟངས་ཀྱིས་སྨྲས་པ།
en: On the right side, Sunetra replied:

source: ཁྱོད་ནི་རི་རབ་ས་ཡི་ནང་ཞུགས་ཏེ། །ཐམས་ཅད་མ་ལུས་བསྲེག་པར་ནུས་གྱུར་ཀྱང་།
en: “You may burn the entire Mount Meru And enter, invisible, into the earth,

source: །ཁྱོད་དང་འདྲ་བ་གང་གཱའི་བྱེ་སྙེད་ཀྱིས། །རྡོ་རྗེའི་ཐུགས་ལྡན་དེ་ནི་བསྲེག་མི་ནུས།
en: But his vajra mind cannot possibly be burned By the likes of you, even if you were equal in number to the grains of sand in the Ganges.

source: །གཞན་ཡང་རི་བོ་ཐམས་ཅད་འགུལ་ཡང་སྲིད།
en: “Moreover: It can happen that all mountains quake,

source: །རྒྱ་མཚོ་ཆེན་པོ་ཟད་ཀྱང་སྲིད།
en: And it may be that the oceans dry up.

source: །ཉི་ཟླ་ས་ལ་ལྷུང་ཡང་སྲིད། །ས་ནི་ཞུ་བར་འགྱུར་ཡང་སྲིད།
en: It is also possible that the sun and moon will fall from the sky, And it may be that the earth will one day melt away. “Yet it is impossible that the one who has set out

source: །འཇིག་རྟེན་དོན་དུ་རྩོམ་མཛད་པ། །ཐུགས་དམ་ངེས་པར་མཛད་པ་པོ། །བྱང་ཆུབ་དམ་པ་མ་ཐོབ་པར། །ཤིང་ཆེན་དྲུང་ནས་བཞེངས་མི་སྲིད།
en: To benefit the world with a firm resolve Should rise from the foot of the great tree Before he attains awakening.”

source: །གཡོན་རོལ་ནས་ལག་རིངས་ཀྱིས་བསྒྱིངས་ཏེ་སྨྲས་པ། ཁྱོད་ཀྱི་གནས་འདིར་མཆིས་བཞིན་དུ།
en: From the left side, Dīrgha­bāhu­garvita said: “Right here before you, I could use my bare hands

source: །བདག་གིས་སུག་པས་ཉི་མ་དང་། །ཟླ་བ་སྐར་མ་རྣམས་ཀྱི་གནས།
en: To grind to dust The sun, the moon, and the stars. “I could, with playful ease,

source: །ཐམས་ཅད་རབ་ཏུ་མཉེ་བར་བགྱི། །རྒྱ་མཚོ་ཆེན་པོ་བཞི་པོ་ལས། །ཚུལ་དུ་ཤིས་པར་ཆབ་ཀྱང་བླང་།
en: Get hold of all the water in the four oceans.

source: །ཡབ་ཅིག་དགེ་སྦྱོང་དེ་བཟུང་སྟེ།
en: Father, I will get hold of this monk

source: །རྒྱ་མཚོའི་ཕ་རོལ་དོར་བར་བགྱི།
en: And throw him to the end of the oceans.

source: །ཡབ་ཅིག་དཔུང་འདི་གཞག་ཏུ་གསོལ།
en: “Father, may this army stand firm!

source: །ཁྱོད་ནི་ཐུགས་ངན་ཆེ་མ་མཛད།
en: Do not be aggrieved!

source: །བྱང་ཆུབ་ཤིང་དེ་དྲུངས་ཕྱུང་སྟེ།
en: I will uproot the Bodhi tree

source: །སུག་པས་ཕྱོགས་ཕྱོགས་གཏོར་བར་བགྱིད།
en: And scatter it everywhere with my hands.”

source: །གཡས་རོལ་ནས་དད་པ་ཐོབ་པས་སྨྲས་པ།
en: From the right side, Prasāda­pratilabdha said:

source: གལ་ཏེ་ཁྱོད་ནི་དྲེགས་བསྒྱིངས་ཏེ། །ལྷ་དང་ལྷ་མིན་དྲི་ཟར་བཅས། །ས་དང་རི་དང་རྒྱ་མཚོར་བཅས། །དེ་དག་ལག་པས་ཕྱིར་རློག་ཀྱང་།
en: “You may proudly assume That you can crush with your hands All gods, demigods, and gandharvas, Along with the earth, the mountains, and the oceans.

source: །ཁྱོད་དང་འདྲ་བ་སྟོང་ཕྲག་ནི།
en: “Yet even thousands of beings like you,

source: །གང་གཱའི་བྱེ་མ་སྙེད་རྣམས་ཀྱིས། །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཅན། །དེ་ཡི་བ་སྤུ་གཡོས་མི་ནུས།
en: As many as there are grains of sand in the Ganges, Would be unable to move a single hair On that wise Bodhisattva.”

source: །གཡོན་རོལ་ནས་འཇིགས་བྱེད་ཀྱིས་སྨྲས་པ།
en: From the left side, Bhayaṃkara said:

source: །དཔུང་གི་ནང་ན་བཞུགས་བཞིན་དུ།
en: “Father, for one who is set in the midst of a great army,

source: །ཡབ་ཁྱོད་ཅི་སླད་རབ་ཏུ་བསྙེངས།
en: What is the use of excessive fear?

source: །དེ་ལ་དཔུང་གྲོགས་ག་ལ་མཆིས།
en: He does not have an army. Where are his allies?

source: །ཅི་སླད་ཁྱོད་འདིར་དེ་ལ་བསྙེངས།
en: Why do you fear him?”

source: །གཡས་རོལ་ནས་བློ་གྲོས་རྩེ་གཅིག་གིས་སྨྲས་པ།
en: From the right side, Ekāgramati said:

source: འཇིག་རྟེན་དག་ན་ཉི་ཟླ་དཔུང་མ་མཆིས།
en: “In the universe, the sun and the moon have no army,

source: །འཁོར་ལོས་སྒྱུར་དང་སེང་གེ་དཔུང་མ་མཆིས།
en: And the universal monarch and the lion have no army.

source: །བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་དཔུང་མ་མཆིས།
en: Likewise this Bodhisattva has no army,

source: །འོན་ཀྱང་གཅིག་པུས་བདུད་ནི་གཞོམ་པར་སྤྱོད།
en: Yet he is capable of destroying Namuci single-handedly.”

source: །གཡོན་རོལ་ནས་གླགས་ལྟས་སྨྲས་པ།
en: From the left side, Avatāraprekṣin said:

source: མདུང་ཐུང་རྩེ་གསུམ་དབྱུག་ཏོ་རལ་གྲི་རྟ།
en: “He has no lances or spears, no clubs or swords,

source: །གླང་པོ་ཤིང་རྟ་རྐང་ཏང་མ་མཆིས་པ།
en: No horses, elephants, chariots, or foot soldiers.

source: །དགེ་སྦྱོང་གཅིག་པུ་མཆིས་པ་དེ་བདག་གིས།
en: That single arrogant monk, sitting there—

source: །དོ་མོད་དགུམ་གྱིས་ཅུང་ཟད་མ་བསྙེངས་ཡབ།
en: Father, I will kill him today, please have no worries.”

source: །གཡས་རོལ་ནས་བསོད་ནམས་བརྒྱན་གྱིས་སྨྲས་པ།
en: From the right side, Puṅyālaṃkāra said:

source: སྲེད་མེད་བུ་ལྟར་མི་ཕྱེད་མི་ཤིགས་སྐུ་དང་ལྡན།
en: “His body is unshakable and indestructible like Nārāyaṇa’s;

source: །བཟོད་སྟོབས་གོ་མནབས་བརྩོན་འགྲུས་བརྟན་པའི་རལ་གྲི་མདའ།
en: He wears an armor of forbearance and wields the sword of unbendable diligence;

source: །རྣམ་པར་ཐར་གསུམ་བཞོན་པ་ཤེས་རབ་གཞུ་ལགས་ཡབ།
en: The threefold liberation is his steed, and knowledge is his bow.

source: །བསོད་ནམས་སྟོབས་ཀྱིས་དེ་ནི་བདུད་ཀྱི་དཔུང་ལས་རྒྱལ།
en: Father, through the force of his merit, the Bodhisattva will conquer Māra’s army.”

source: །གཡོན་རོལ་ནས་ཕྱིར་མི་ལྡོག་པས་སྨྲས་པ།
en: From the left side, Anivartin said:

source: འབྲོག་མེ་རྩྭ་ལ་ཚིག་པ་ཕྱིར་མི་ལྡོག །ལོབས་པས་འཕངས་པའི་མདའ་ཡང་ཕྱིར་མི་ལྡོག །མཁའ་ལས་རྡོ་རྗེ་འབབ་པ་ཕྱིར་མི་ལྡོག །ཤཱཀྱའི་བུ་ལས་མ་རྒྱལ་བདག་གནས་མེད།
en: “The fire burning on the plains does not shy away from burning the grass; The arrow shot skillfully cannot be stopped by a learned one; The bolt of lightning shooting across the sky does not return. I will not rest until I have conquered the son of the Śākyas.”

source: །གཡས་རོལ་ནས་ཆོས་འདོད་ཀྱིས་སྨྲས་པ།
en: From the right side, Dharmakāma said:

source: གཤེར་བའི་རྩྭ་དང་ཕྲད་ན་མེ་ཡང་ལྡོག །བྲག་གི་རྩེ་མོར་བབ་ན་མདའ་ཡང་ལྡོག །རྡོ་རྗེ་སར་བབ་དེ་ནས་གང་དུ་འགྲོ།
en: “When meeting wet grass, the fire retreats; When the arrow hits a mountain peak, it rebounds; The bolt of lightning, having hit the ground, sinks down.

source: །ཞི་བ་བདུད་རྩི་མ་ཐོབ་དེ་མི་ལྡོག །ཅིའི་ཕྱིར་ཞེ་ན།
en: Until the Bodhisattva obtains peaceful immortality, he will not retreat.” “And why?

source: ཡབ་ཅིག་བར་སྣང་ལ་ནི་རི་མོ་བྲི་བར་ནུས་ཀྱང་གདའ།
en: Father, even if one could draw pictures in the empty sky,

source: །སེམས་ཅན་ཇི་སྙེད་ཀུན་གྱི་སེམས་ནི་གཅིག་བསྡུར་ནུས་ཀྱང་གདའ།
en: Or gather the minds of all sentient beings, as many as there are, into one,

source: །ཡབ་ཅིག་ཉི་ཟླ་རླུང་ནི་ཞགས་པས་བཅིང་དུ་ནུས་ཀྱང་གདའ།
en: Or, my father, bind the sun, the moon, and the wind with a noose,

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སྙིང་པོ་ལས་ནི་བསྐྱོད་མི་ནུས།
en: One could still not move the Bodhisattva from the seat of awakening.”

source: །གཡོན་རོལ་ནས་ཉེ་བར་མ་ཞི་བས་སྨྲས་པ།
en: From the left side, Anupaśānta said:

source: ལྟ་བའི་གདུག་པ་ཆེན་པོས་ལྷུན་པོ་བསྲེག་པར་བགྱི།
en: “With the great poison of my gaze, I can burn Mount Meru

source: །རྒྱ་མཚོ་ཆེན་པོ་རྣམས་ཀྱི་ཆབ་ཀྱང་བསྐམ་པར་བགྱི། །
en: And turn the waters in the great oceans to ashes.

source: བདག་གིས་དོ་མོད་དེ་གཉིས་ཐལ་བར་བརླག་པར་བགྱི། །ཡབ་ཅིག་བྱང་ཆུབ་དང་ནི་དགེ་སྦྱོང་གཟིགས་སུ་གསོལ།
en: So, father, look at the seat of awakening and that monk As I now turn both of them to ashes with my gaze.”

source: །གཡས་རོལ་ནས་དོན་གྲུབ་ཀྱིས་སྨྲས་པ།
en: From the right side, Siddhārtha said:

source: གལ་ཏེ་དུག་གིས་འདི་ཀུན་གང་གྱུར་ལ།
en: “You may be able to fill the world with poison

source: །སྟོང་གསུམ་དམ་པ་རབ་ཏུ་འབར་གྱུར་ཀྱང་།
en: And put ablaze the great trichiliocosm,

source: །ཡོན་ཏན་འབྱུང་གནས་ཀྱིས་ནི་གཟིགས་ཙམ་གྱིས།
en: Yet by a mere glance from the One Who Is the Source of All Good Qualities,

source: །དུག་ནི་དུག་མ་ཡིན་པར་རབ་ཏུ་འགྱུར།
en: Your poison will lose its toxicity.

source: །སྲིད་པ་གསུམ་ན་གདུག་པ་དྲག་པོ་ནི།
en: “In the three realms, there are fierce poisons

source: །འདོད་ཆགས་ཞེ་སྡང་དེ་བཞིན་གཏི་མུག་སྟེ།
en: In the form of attachment, anger, and delusion.

source: །དེ་དག་དེ་ཡི་སྐུ་དང་ཐུགས་ལ་མེད།
en: Yet none of them can be found in his body, nor in his mind,

source: །མཁའ་ལ་རྫབ་དང་རྡུལ་ནི་མེད་པ་བཞིན།
en: Just as mud and dust cannot be found in the heavens.

source: །སྐུ་དང་གསུང་དང་ཐུགས་ཀྱང་རབ་ཏུ་དག །
en: “His body, speech, and mind are pristine,

source: སེམས་ཅན་ཀུན་ལ་བྱམས་པའི་ཐུགས་དང་ལྡན།
en: And he is filled with love for sentient beings.

source: །དེ་ལ་མཚོན་དང་དུག་གིས་ཡོང་མི་ཚུགས།
en: No weapon or poison will be able to harm him,

source: །དེ་བས་ཡབ་ཅིག་ཐམས་ཅད་བཟློག་ཏུ་གསོལ།
en: So, father, please, let us all turn back.”

source: །གཡོན་རོལ་ནས་དགའ་བ་ཆགས་པས་སྨྲས་པ།
en: From the left side, Ratilola said:

source: བདག་གིས་སིལ་སྙན་སྟོང་དག་རབ་བགྱིས་ཏེ།
en: “I will play thousands of instruments

source: །ལྷ་ཡི་བུ་མོ་བརྒྱན་པ་བྱེ་སྟོང་གིས།
en: And send forth billions of well-adorned divine girls

source: །ཆགས་པར་བགྱིས་ཏེ་གྲོང་ཁྱེར་མཆོག་ཏུ་བཀྲི།
en: Who will get him excited and lead him to our exquisite harem.

source: །འདོད་ལ་དགའ་བར་ཁྱོད་ཀྱི་དབང་དུ་བགྱི།
en: I will provide sexual pleasure and bring him under your control.”

source: །གཡས་རོལ་ནས་ཆོས་དགས་སྨྲས་པ།
en: From the right side, Dharmarati said:

source: དེ་འདིར་རྟག་ཏུ་ཆོས་ལ་དགྱེས་པས་དགྱེས།
en: “He only delights in the pleasures of the Dharma,

source: །བསམ་གཏན་དགྱེས་ཤིང་བདུད་རྩི་དོན་ལ་དགྱེས།
en: The bliss of concentration and the significance of immortality,

source: །སེམས་ཅན་ཐར་བར་མཛད་དང་བྱམས་ལ་དགྱེས།
en: And the joy of liberating sentient beings and the happiness of a loving mind.

source: །འདོད་ཆགས་དགའ་ལ་དེ་ནི་དགྱེས་མི་མཛད།
en: He does not delight in the pleasures of passion.”

source: །གཡོན་རོལ་ནས་རླུང་གི་ཤུགས་ཞེས་བྱ་བས་སྨྲས་པ།
en: From the left side, Vātajava said:

source: བདག་གི་ཤུགས་ཀྱིས་ཉི་ཟླ་མིད་བགྱིས་ལ།
en: “I can at once swallow the sun and the moon
